---
title: ExternalDataInstanceAddedIntoDocumentEventArgs
classe: Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ExternalDataInstanceAddedIntoDocumentEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String ItemId { get; }` | `externalDataInstanceAddedIntoDocumentEventArgs.ItemId` | String |
| `ElementId NewInstanceId { get; }` | `externalDataInstanceAddedIntoDocumentEventArgs.NewInstanceId` | ElementId |
| `String ProjectId { get; }` | `externalDataInstanceAddedIntoDocumentEventArgs.ProjectId` | String |
| `ElementId TypeId { get; }` | `externalDataInstanceAddedIntoDocumentEventArgs.TypeId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```